n5/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Barcodes</name>
  <resources>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </resources>
  <resources>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </resources>
  <resources>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </resources>
  <resources>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </resources>
  <dimensions>
    <name>Barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/CommonModules/RunStockman/Module.bsl
Procedure MakeBarcodes ( Document ) export

	SetPrivilegedMode ( true );
	lockBarcodes ();
	for each row in getNew ( Document ) do
		r = InformationRegisters.Barcodes.CreateRecordManager ();
		r.Barcode = Goods.NewEAN13 ();
		r.Item = row.Item;
		r.Feature = row.Feature;
		r.Package = row.Package;
		r.Series = row.Series;
		r.Write ();
	enddo;
	
EndProcedure

Procedure lockBarcodes ()

	lock = new DataLock ();
	item = lock.Add ( "InformationRegister.Barcodes");
	item.Mode = DataLockMode.Exclusive;
	lock.Lock ();

EndProcedure

Function getNew ( Document )
	
	name = Metadata.FindByType ( TypeOf ( Document ) ).Name;
	s = "
	|select distinct Items.Item as Item, Items.Series as Series, Items.Package as Package, Items.Feature as Feature
	|from Document." + name + ".Items as Items
	|	//
	|	// Barcodes
	|	//
	|	left join InformationRegister.Barcodes as Barcodes
	|	on Barcodes.Series = Items.Series
	|	and Barcodes.Package = Items.Package
	|	and Barcodes.Item = Items.Item
	|	and Barcodes.Feature = Items.Feature
	|where Items.Ref = &Ref
	|and Barcodes.Barcode is null
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Document );
	return q.Execute ().Unload ();
	
EndFunction
